Microchip-MPLAB-Harmony/reference_apps_pic32cm/apps/pic32cm_jh_vl_cnano/pic32cm_jh_vl_cnano_mikroe_click/pic32cm_jh_mcp25625/firmware/src/packs/PIC32CM6408JH00064_DFP/component/supc.h
/*
 * Component description for SUPC
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2022-03-14T06:27:59Z  */
#ifndef _PIC32CMJH00_SUPC_COMPONENT_H_
#define _PIC32CMJH00_SUPC_COMPONENT_H_

#include "core_cm0plus.h"

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR SUPC                      */
/* ************************************************************************** */

/* -------- SUPC_INTENCLR : (SUPC Offset: 0x00) (R/W 32) Interrupt Enable Clear -------- */
#define SUPC_INTENCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (SUPC_INTENCLR) Interrupt Enable Clear  Reset Value */

#define SUPC_INTENCLR_BODVDDRDY_Pos           _UINT32_(0)                                          /* (SUPC_INTENCLR) BODVDD Ready Position */
#define SUPC_INTENCLR_BODVDDRDY_Msk           (_UINT32_(0x1) << SUPC_INTENCLR_BODVDDRDY_Pos)       /* (SUPC_INTENCLR) BODVDD Ready Mask */
#define SUPC_INTENCLR_BODVDDRDY(value)        (SUPC_INTENCLR_BODVDDRDY_Msk & (_UINT32_(value) << SUPC_INTENCLR_BODVDDRDY_Pos)) /* Assignment of value for BODVDDRDY in the SUPC_INTENCLR register */
#define SUPC_INTENCLR_BODVDDDET_Pos           _UINT32_(1)                                          /* (SUPC_INTENCLR) BODVDD Detection Position */
#define SUPC_INTENCLR_BODVDDDET_Msk           (_UINT32_(0x1) << SUPC_INTENCLR_BODVDDDET_Pos)       /* (SUPC_INTENCLR) BODVDD Detection Mask */
#define SUPC_INTENCLR_BODVDDDET(value)        (SUPC_INTENCLR_BODVDDDET_Msk & (_UINT32_(value) << SUPC_INTENCLR_BODVDDDET_Pos)) /* Assignment of value for BODVDDDET in the SUPC_INTENCLR register */
#define SUPC_INTENCLR_BVDDSRDY_Pos            _UINT32_(2)                                          /* (SUPC_INTENCLR) BODVDD Synchronization Ready Position */
#define SUPC_INTENCLR_BVDDSRDY_Msk            (_UINT32_(0x1) << SUPC_INTENCLR_BVDDSRDY_Pos)        /* (SUPC_INTENCLR) BODVDD Synchronization Ready Mask */
#define SUPC_INTENCLR_BVDDSRDY(value)         (SUPC_INTENCLR_BVDDSRDY_Msk & (_UINT32_(value) << SUPC_INTENCLR_BVDDSRDY_Pos)) /* Assignment of value for BVDDSRDY in the SUPC_INTENCLR register */
#define SUPC_INTENCLR_BODCORERDY_Pos          _UINT32_(3)                                          /* (SUPC_INTENCLR) BODCORE Ready Position */
#define SUPC_INTENCLR_BODCORERDY_Msk          (_UINT32_(0x1) << SUPC_INTENCLR_BODCORERDY_Pos)      /* (SUPC_INTENCLR) BODCORE Ready Mask */
#define SUPC_INTENCLR_BODCORERDY(value)       (SUPC_INTENCLR_BODCORERDY_Msk & (_UINT32_(value) << SUPC_INTENCLR_BODCORERDY_Pos)) /* Assignment of value for BODCORERDY in the SUPC_INTENCLR register */
#define SUPC_INTENCLR_BODCOREDET_Pos          _UINT32_(4)                                          /* (SUPC_INTENCLR) BODCORE Detection Position */
#define SUPC_INTENCLR_BODCOREDET_Msk          (_UINT32_(0x1) << SUPC_INTENCLR_BODCOREDET_Pos)      /* (SUPC_INTENCLR) BODCORE Detection Mask */
#define SUPC_INTENCLR_BODCOREDET(value)       (SUPC_INTENCLR_BODCOREDET_Msk & (_UINT32_(value) << SUPC_INTENCLR_BODCOREDET_Pos)) /* Assignment of value for BODCOREDET in the SUPC_INTENCLR register */
#define SUPC_INTENCLR_BCORESRDY_Pos           _UINT32_(5)                                          /* (SUPC_INTENCLR) BODCORE Synchronization Ready Position */
#define SUPC_INTENCLR_BCORESRDY_Msk           (_UINT32_(0x1) << SUPC_INTENCLR_BCORESRDY_Pos)       /* (SUPC_INTENCLR) BODCORE Synchronization Ready Mask */
#define SUPC_INTENCLR_BCORESRDY(value)        (SUPC_INTENCLR_BCORESRDY_Msk & (_UINT32_(value) << SUPC_INTENCLR_BCORESRDY_Pos)) /* Assignment of value for BCORESRDY in the SUPC_INTENCLR register */
#define SUPC_INTENCLR_Msk                     _UINT32_(0x0000003F)                                 /* (SUPC_INTENCLR) Register Mask  */


/* -------- SUPC_INTENSET : (SUPC Offset: 0x04) (R/W 32) Interrupt Enable Set -------- */
#define SUPC_INTENSET_RESETVALUE              _UINT32_(0x00)                                       /*  (SUPC_INTENSET) Interrupt Enable Set  Reset Value */

#define SUPC_INTENSET_BODVDDRDY_Pos           _UINT32_(0)                                          /* (SUPC_INTENSET) BODVDD Ready Position */
#define SUPC_INTENSET_BODVDDRDY_Msk           (_UINT32_(0x1) << SUPC_INTENSET_BODVDDRDY_Pos)       /* (SUPC_INTENSET) BODVDD Ready Mask */
#define SUPC_INTENSET_BODVDDRDY(value)        (SUPC_INTENSET_BODVDDRDY_Msk & (_UINT32_(value) << SUPC_INTENSET_BODVDDRDY_Pos)) /* Assignment of value for BODVDDRDY in the SUPC_INTENSET register */
#define SUPC_INTENSET_BODVDDDET_Pos           _UINT32_(1)                                          /* (SUPC_INTENSET) BODVDD Detection Position */
#define SUPC_INTENSET_BODVDDDET_Msk           (_UINT32_(0x1) << SUPC_INTENSET_BODVDDDET_Pos)       /* (SUPC_INTENSET) BODVDD Detection Mask */
#define SUPC_INTENSET_BODVDDDET(value)        (SUPC_INTENSET_BODVDDDET_Msk & (_UINT32_(value) << SUPC_INTENSET_BODVDDDET_Pos)) /* Assignment of value for BODVDDDET in the SUPC_INTENSET register */
#define SUPC_INTENSET_BVDDSRDY_Pos            _UINT32_(2)                                          /* (SUPC_INTENSET) BODVDD Synchronization Ready Position */
#define SUPC_INTENSET_BVDDSRDY_Msk            (_UINT32_(0x1) << SUPC_INTENSET_BVDDSRDY_Pos)        /* (SUPC_INTENSET) BODVDD Synchronization Ready Mask */
#define SUPC_INTENSET_BVDDSRDY(value)         (SUPC_INTENSET_BVDDSRDY_Msk & (_UINT32_(value) << SUPC_INTENSET_BVDDSRDY_Pos)) /* Assignment of value for BVDDSRDY in the SUPC_INTENSET register */
#define SUPC_INTENSET_BODCORERDY_Pos          _UINT32_(3)                                          /* (SUPC_INTENSET) BODCORE Ready Position */
#define SUPC_INTENSET_BODCORERDY_Msk          (_UINT32_(0x1) << SUPC_INTENSET_BODCORERDY_Pos)      /* (SUPC_INTENSET) BODCORE Ready Mask */
#define SUPC_INTENSET_BODCORERDY(value)       (SUPC_INTENSET_BODCORERDY_Msk & (_UINT32_(value) << SUPC_INTENSET_BODCORERDY_Pos)) /* Assignment of value for BODCORERDY in the SUPC_INTENSET register */
#define SUPC_INTENSET_BODCOREDET_Pos          _UINT32_(4)                                          /* (SUPC_INTENSET) BODCORE Detection Position */
#define SUPC_INTENSET_BODCOREDET_Msk          (_UINT32_(0x1) << SUPC_INTENSET_BODCOREDET_Pos)      /* (SUPC_INTENSET) BODCORE Detection Mask */
#define SUPC_INTENSET_BODCOREDET(value)       (SUPC_INTENSET_BODCOREDET_Msk & (_UINT32_(value) << SUPC_INTENSET_BODCOREDET_Pos)) /* Assignment of value for BODCOREDET in the SUPC_INTENSET register */
#define SUPC_INTENSET_BCORESRDY_Pos           _UINT32_(5)                                          /* (SUPC_INTENSET) BODCORE Synchronization Ready Position */
#define SUPC_INTENSET_BCORESRDY_Msk           (_UINT32_(0x1) << SUPC_INTENSET_BCORESRDY_Pos)       /* (SUPC_INTENSET) BODCORE Synchronization Ready Mask */
#define SUPC_INTENSET_BCORESRDY(value)        (SUPC_INTENSET_BCORESRDY_Msk & (_UINT32_(value) << SUPC_INTENSET_BCORESRDY_Pos)) /* Assignment of value for BCORESRDY in the SUPC_INTENSET register */
#define SUPC_INTENSET_Msk                     _UINT32_(0x0000003F)                                 /* (SUPC_INTENSET) Register Mask  */


/* -------- SUPC_INTFLAG : (SUPC Offset: 0x08) (R/W 32) Interrupt Flag Status and Clear -------- */
#define SUPC_INTFLAG_RESETVALUE               _UINT32_(0x00)                                       /*  (SUPC_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define SUPC_INTFLAG_BODVDDRDY_Pos            _UINT32_(0)                                          /* (SUPC_INTFLAG) BODVDD Ready Position */
#define SUPC_INTFLAG_BODVDDRDY_Msk            (_UINT32_(0x1) << SUPC_INTFLAG_BODVDDRDY_Pos)        /* (SUPC_INTFLAG) BODVDD Ready Mask */
#define SUPC_INTFLAG_BODVDDRDY(value)         (SUPC_INTFLAG_BODVDDRDY_Msk & (_UINT32_(value) << SUPC_INTFLAG_BODVDDRDY_Pos)) /* Assignment of value for BODVDDRDY in the SUPC_INTFLAG register */
#define SUPC_INTFLAG_BODVDDDET_Pos            _UINT32_(1)                                          /* (SUPC_INTFLAG) BODVDD Detection Position */
#define SUPC_INTFLAG_BODVDDDET_Msk            (_UINT32_(0x1) << SUPC_INTFLAG_BODVDDDET_Pos)        /* (SUPC_INTFLAG) BODVDD Detection Mask */
#define SUPC_INTFLAG_BODVDDDET(value)         (SUPC_INTFLAG_BODVDDDET_Msk & (_UINT32_(value) << SUPC_INTFLAG_BODVDDDET_Pos)) /* Assignment of value for BODVDDDET in the SUPC_INTFLAG register */
#define SUPC_INTFLAG_BVDDSRDY_Pos             _UINT32_(2)                                          /* (SUPC_INTFLAG) BODVDD Synchronization Ready Position */
#define SUPC_INTFLAG_BVDDSRDY_Msk             (_UINT32_(0x1) << SUPC_INTFLAG_BVDDSRDY_Pos)         /* (SUPC_INTFLAG) BODVDD Synchronization Ready Mask */
#define SUPC_INTFLAG_BVDDSRDY(value)          (SUPC_INTFLAG_BVDDSRDY_Msk & (_UINT32_(value) << SUPC_INTFLAG_BVDDSRDY_Pos)) /* Assignment of value for BVDDSRDY in the SUPC_INTFLAG register */
#define SUPC_INTFLAG_BODCORERDY_Pos           _UINT32_(3)                                          /* (SUPC_INTFLAG) BODCORE Ready Position */
#define SUPC_INTFLAG_BODCORERDY_Msk           (_UINT32_(0x1) << SUPC_INTFLAG_BODCORERDY_Pos)       /* (SUPC_INTFLAG) BODCORE Ready Mask */
#define SUPC_INTFLAG_BODCORERDY(value)        (SUPC_INTFLAG_BODCORERDY_Msk & (_UINT32_(value) << SUPC_INTFLAG_BODCORERDY_Pos)) /* Assignment of value for BODCORERDY in the SUPC_INTFLAG register */
#define SUPC_INTFLAG_BODCOREDET_Pos           _UINT32_(4)                                          /* (SUPC_INTFLAG) BODCORE Detection Position */
#define SUPC_INTFLAG_BODCOREDET_Msk           (_UINT32_(0x1) << SUPC_INTFLAG_BODCOREDET_Pos)       /* (SUPC_INTFLAG) BODCORE Detection Mask */
#define SUPC_INTFLAG_BODCOREDET(value)        (SUPC_INTFLAG_BODCOREDET_Msk & (_UINT32_(value) << SUPC_INTFLAG_BODCOREDET_Pos)) /* Assignment of value for BODCOREDET in the SUPC_INTFLAG register */
#define SUPC_INTFLAG_BCORESRDY_Pos            _UINT32_(5)                                          /* (SUPC_INTFLAG) BODCORE Synchronization Ready Position */
#define SUPC_INTFLAG_BCORESRDY_Msk            (_UINT32_(0x1) << SUPC_INTFLAG_BCORESRDY_Pos)        /* (SUPC_INTFLAG) BODCORE Synchronization Ready Mask */
#define SUPC_INTFLAG_BCORESRDY(value)         (SUPC_INTFLAG_BCORESRDY_Msk & (_UINT32_(value) << SUPC_INTFLAG_BCORESRDY_Pos)) /* Assignment of value for BCORESRDY in the SUPC_INTFLAG register */
#define SUPC_INTFLAG_Msk                      _UINT32_(0x0000003F)                                 /* (SUPC_INTFLAG) Register Mask  */


/* -------- SUPC_STATUS : (SUPC Offset: 0x0C) ( R/ 32) Power and Clocks Status -------- */
#define SUPC_STATUS_RESETVALUE                _UINT32_(0x00)                                       /*  (SUPC_STATUS) Power and Clocks Status  Reset Value */

#define SUPC_STATUS_BODVDDRDY_Pos             _UINT32_(0)                                          /* (SUPC_STATUS) BODVDD Ready Position */
#define SUPC_STATUS_BODVDDRDY_Msk             (_UINT32_(0x1) << SUPC_STATUS_BODVDDRDY_Pos)         /* (SUPC_STATUS) BODVDD Ready Mask */
#define SUPC_STATUS_BODVDDRDY(value)          (SUPC_STATUS_BODVDDRDY_Msk & (_UINT32_(value) << SUPC_STATUS_BODVDDRDY_Pos)) /* Assignment of value for BODVDDRDY in the SUPC_STATUS register */
#define SUPC_STATUS_BODVDDDET_Pos             _UINT32_(1)                                          /* (SUPC_STATUS) BODVDD Detection Position */
#define SUPC_STATUS_BODVDDDET_Msk             (_UINT32_(0x1) << SUPC_STATUS_BODVDDDET_Pos)         /* (SUPC_STATUS) BODVDD Detection Mask */
#define SUPC_STATUS_BODVDDDET(value)          (SUPC_STATUS_BODVDDDET_Msk & (_UINT32_(value) << SUPC_STATUS_BODVDDDET_Pos)) /* Assignment of value for BODVDDDET in the SUPC_STATUS register */
#define SUPC_STATUS_BVDDSRDY_Pos              _UINT32_(2)                                          /* (SUPC_STATUS) BODVDD Synchronization Ready Position */
#define SUPC_STATUS_BVDDSRDY_Msk              (_UINT32_(0x1) << SUPC_STATUS_BVDDSRDY_Pos)          /* (SUPC_STATUS) BODVDD Synchronization Ready Mask */
#define SUPC_STATUS_BVDDSRDY(value)           (SUPC_STATUS_BVDDSRDY_Msk & (_UINT32_(value) << SUPC_STATUS_BVDDSRDY_Pos)) /* Assignment of value for BVDDSRDY in the SUPC_STATUS register */
#define SUPC_STATUS_BODCORERDY_Pos            _UINT32_(3)                                          /* (SUPC_STATUS) BODCORE Ready Position */
#define SUPC_STATUS_BODCORERDY_Msk            (_UINT32_(0x1) << SUPC_STATUS_BODCORERDY_Pos)        /* (SUPC_STATUS) BODCORE Ready Mask */
#define SUPC_STATUS_BODCORERDY(value)         (SUPC_STATUS_BODCORERDY_Msk & (_UINT32_(value) << SUPC_STATUS_BODCORERDY_Pos)) /* Assignment of value for BODCORERDY in the SUPC_STATUS register */
#define SUPC_STATUS_BODCOREDET_Pos            _UINT32_(4)                                          /* (SUPC_STATUS) BODCORE Detection Position */
#define SUPC_STATUS_BODCOREDET_Msk            (_UINT32_(0x1) << SUPC_STATUS_BODCOREDET_Pos)        /* (SUPC_STATUS) BODCORE Detection Mask */
#define SUPC_STATUS_BODCOREDET(value)         (SUPC_STATUS_BODCOREDET_Msk & (_UINT32_(value) << SUPC_STATUS_BODCOREDET_Pos)) /* Assignment of value for BODCOREDET in the SUPC_STATUS register */
#define SUPC_STATUS_BCORESRDY_Pos             _UINT32_(5)                                          /* (SUPC_STATUS) BODCORE Synchronization Ready Position */
#define SUPC_STATUS_BCORESRDY_Msk             (_UINT32_(0x1) << SUPC_STATUS_BCORESRDY_Pos)         /* (SUPC_STATUS) BODCORE Synchronization Ready Mask */
#define SUPC_STATUS_BCORESRDY(value)          (SUPC_STATUS_BCORESRDY_Msk & (_UINT32_(value) << SUPC_STATUS_BCORESRDY_Pos)) /* Assignment of value for BCORESRDY in the SUPC_STATUS register */
#define SUPC_STATUS_Msk                       _UINT32_(0x0000003F)                                 /* (SUPC_STATUS) Register Mask  */


/* -------- SUPC_BODVDD : (SUPC Offset: 0x10) (R/W 32) BODVDD Control -------- */
#define SUPC_BODVDD_RESETVALUE                _UINT32_(0x00)                                       /*  (SUPC_BODVDD) BODVDD Control  Reset Value */

