Microchip-MPLAB-Harmony/reference_apps_pic32cm/apps/pic32cm_jh_vl_cnano/pic32cm_jh_vl_cnano_mikroe_click/pic32cm_jh_mcp25625/firmware/src/packs/PIC32CM6408JH00064_DFP/component/supc.h
#define SUPC_BODVDD_ENABLE_Pos                _UINT32_(1)                                          /* (SUPC_BODVDD) Enable Position */
#define SUPC_BODVDD_ENABLE_Msk                (_UINT32_(0x1) << SUPC_BODVDD_ENABLE_Pos)            /* (SUPC_BODVDD) Enable Mask */
#define SUPC_BODVDD_ENABLE(value)             (SUPC_BODVDD_ENABLE_Msk & (_UINT32_(value) << SUPC_BODVDD_ENABLE_Pos)) /* Assignment of value for ENABLE in the SUPC_BODVDD register */
#define SUPC_BODVDD_HYST_Pos                  _UINT32_(2)                                          /* (SUPC_BODVDD) Hysteresis Enable Position */
#define SUPC_BODVDD_HYST_Msk                  (_UINT32_(0x1) << SUPC_BODVDD_HYST_Pos)              /* (SUPC_BODVDD) Hysteresis Enable Mask */
#define SUPC_BODVDD_HYST(value)               (SUPC_BODVDD_HYST_Msk & (_UINT32_(value) << SUPC_BODVDD_HYST_Pos)) /* Assignment of value for HYST in the SUPC_BODVDD register */
#define SUPC_BODVDD_ACTION_Pos                _UINT32_(3)                                          /* (SUPC_BODVDD) Action when Threshold Crossed Position */
#define SUPC_BODVDD_ACTION_Msk                (_UINT32_(0x3) << SUPC_BODVDD_ACTION_Pos)            /* (SUPC_BODVDD) Action when Threshold Crossed Mask */
#define SUPC_BODVDD_ACTION(value)             (SUPC_BODVDD_ACTION_Msk & (_UINT32_(value) << SUPC_BODVDD_ACTION_Pos)) /* Assignment of value for ACTION in the SUPC_BODVDD register */
#define   SUPC_BODVDD_ACTION_NONE_Val         _UINT32_(0x0)                                        /* (SUPC_BODVDD) No action  */
#define   SUPC_BODVDD_ACTION_RESET_Val        _UINT32_(0x1)                                        /* (SUPC_BODVDD) The BODVDD generates a reset  */
#define   SUPC_BODVDD_ACTION_INT_Val          _UINT32_(0x2)                                        /* (SUPC_BODVDD) The BODVDD generates an interrupt  */
#define SUPC_BODVDD_ACTION_NONE               (SUPC_BODVDD_ACTION_NONE_Val << SUPC_BODVDD_ACTION_Pos) /* (SUPC_BODVDD) No action Position */
#define SUPC_BODVDD_ACTION_RESET              (SUPC_BODVDD_ACTION_RESET_Val << SUPC_BODVDD_ACTION_Pos) /* (SUPC_BODVDD) The BODVDD generates a reset Position */
#define SUPC_BODVDD_ACTION_INT                (SUPC_BODVDD_ACTION_INT_Val << SUPC_BODVDD_ACTION_Pos) /* (SUPC_BODVDD) The BODVDD generates an interrupt Position */
#define SUPC_BODVDD_STDBYCFG_Pos              _UINT32_(5)                                          /* (SUPC_BODVDD) Configuration in Standby mode Position */
#define SUPC_BODVDD_STDBYCFG_Msk              (_UINT32_(0x1) << SUPC_BODVDD_STDBYCFG_Pos)          /* (SUPC_BODVDD) Configuration in Standby mode Mask */
#define SUPC_BODVDD_STDBYCFG(value)           (SUPC_BODVDD_STDBYCFG_Msk & (_UINT32_(value) << SUPC_BODVDD_STDBYCFG_Pos)) /* Assignment of value for STDBYCFG in the SUPC_BODVDD register */
#define SUPC_BODVDD_RUNSTDBY_Pos              _UINT32_(6)                                          /* (SUPC_BODVDD) Run during Standby Position */
#define SUPC_BODVDD_RUNSTDBY_Msk              (_UINT32_(0x1) << SUPC_BODVDD_RUNSTDBY_Pos)          /* (SUPC_BODVDD) Run during Standby Mask */
#define SUPC_BODVDD_RUNSTDBY(value)           (SUPC_BODVDD_RUNSTDBY_Msk & (_UINT32_(value) << SUPC_BODVDD_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the SUPC_BODVDD register */
#define SUPC_BODVDD_ACTCFG_Pos                _UINT32_(8)                                          /* (SUPC_BODVDD) Configuration in Active mode Position */
#define SUPC_BODVDD_ACTCFG_Msk                (_UINT32_(0x1) << SUPC_BODVDD_ACTCFG_Pos)            /* (SUPC_BODVDD) Configuration in Active mode Mask */
#define SUPC_BODVDD_ACTCFG(value)             (SUPC_BODVDD_ACTCFG_Msk & (_UINT32_(value) << SUPC_BODVDD_ACTCFG_Pos)) /* Assignment of value for ACTCFG in the SUPC_BODVDD register */
#define SUPC_BODVDD_PSEL_Pos                  _UINT32_(12)                                         /* (SUPC_BODVDD) Prescaler Select Position */
#define SUPC_BODVDD_PSEL_Msk                  (_UINT32_(0xF) << SUPC_BODVDD_PSEL_Pos)              /* (SUPC_BODVDD) Prescaler Select Mask */
#define SUPC_BODVDD_PSEL(value)               (SUPC_BODVDD_PSEL_Msk & (_UINT32_(value) << SUPC_BODVDD_PSEL_Pos)) /* Assignment of value for PSEL in the SUPC_BODVDD register */
#define   SUPC_BODVDD_PSEL_DIV2_Val           _UINT32_(0x0)                                        /* (SUPC_BODVDD) Divide clock by 2  */
#define   SUPC_BODVDD_PSEL_DIV4_Val           _UINT32_(0x1)                                        /* (SUPC_BODVDD) Divide clock by 4  */
#define   SUPC_BODVDD_PSEL_DIV8_Val           _UINT32_(0x2)                                        /* (SUPC_BODVDD) Divide clock by 8  */
#define   SUPC_BODVDD_PSEL_DIV16_Val          _UINT32_(0x3)                                        /* (SUPC_BODVDD) Divide clock by 16  */
#define   SUPC_BODVDD_PSEL_DIV32_Val          _UINT32_(0x4)                                        /* (SUPC_BODVDD) Divide clock by 32  */
#define   SUPC_BODVDD_PSEL_DIV64_Val          _UINT32_(0x5)                                        /* (SUPC_BODVDD) Divide clock by 64  */
#define   SUPC_BODVDD_PSEL_DIV128_Val         _UINT32_(0x6)                                        /* (SUPC_BODVDD) Divide clock by 128  */
#define   SUPC_BODVDD_PSEL_DIV256_Val         _UINT32_(0x7)                                        /* (SUPC_BODVDD) Divide clock by 256  */
#define   SUPC_BODVDD_PSEL_DIV512_Val         _UINT32_(0x8)                                        /* (SUPC_BODVDD) Divide clock by 512  */
#define   SUPC_BODVDD_PSEL_DIV1024_Val        _UINT32_(0x9)                                        /* (SUPC_BODVDD) Divide clock by 1024  */
#define   SUPC_BODVDD_PSEL_DIV2048_Val        _UINT32_(0xA)                                        /* (SUPC_BODVDD) Divide clock by 2048  */
#define   SUPC_BODVDD_PSEL_DIV4096_Val        _UINT32_(0xB)                                        /* (SUPC_BODVDD) Divide clock by 4096  */
#define   SUPC_BODVDD_PSEL_DIV8192_Val        _UINT32_(0xC)                                        /* (SUPC_BODVDD) Divide clock by 8192  */
#define   SUPC_BODVDD_PSEL_DIV16384_Val       _UINT32_(0xD)                                        /* (SUPC_BODVDD) Divide clock by 16384  */
#define   SUPC_BODVDD_PSEL_DIV32768_Val       _UINT32_(0xE)                                        /* (SUPC_BODVDD) Divide clock by 32768  */
#define   SUPC_BODVDD_PSEL_DIV65536_Val       _UINT32_(0xF)                                        /* (SUPC_BODVDD) Divide clock by 65536  */
#define SUPC_BODVDD_PSEL_DIV2                 (SUPC_BODVDD_PSEL_DIV2_Val << SUPC_BODVDD_PSEL_Pos)  /* (SUPC_BODVDD) Divide clock by 2 Position */
#define SUPC_BODVDD_PSEL_DIV4                 (SUPC_BODVDD_PSEL_DIV4_Val << SUPC_BODVDD_PSEL_Pos)  /* (SUPC_BODVDD) Divide clock by 4 Position */
#define SUPC_BODVDD_PSEL_DIV8                 (SUPC_BODVDD_PSEL_DIV8_Val << SUPC_BODVDD_PSEL_Pos)  /* (SUPC_BODVDD) Divide clock by 8 Position */
#define SUPC_BODVDD_PSEL_DIV16                (SUPC_BODVDD_PSEL_DIV16_Val << SUPC_BODVDD_PSEL_Pos) /* (SUPC_BODVDD) Divide clock by 16 Position */
#define SUPC_BODVDD_PSEL_DIV32                (SUPC_BODVDD_PSEL_DIV32_Val << SUPC_BODVDD_PSEL_Pos) /* (SUPC_BODVDD) Divide clock by 32 Position */
#define SUPC_BODVDD_PSEL_DIV64                (SUPC_BODVDD_PSEL_DIV64_Val << SUPC_BODVDD_PSEL_Pos) /* (SUPC_BODVDD) Divide clock by 64 Position */
#define SUPC_BODVDD_PSEL_DIV128               (SUPC_BODVDD_PSEL_DIV128_Val << SUPC_BODVDD_PSEL_Pos) /* (SUPC_BODVDD) Divide clock by 128 Position */
#define SUPC_BODVDD_PSEL_DIV256               (SUPC_BODVDD_PSEL_DIV256_Val << SUPC_BODVDD_PSEL_Pos) /* (SUPC_BODVDD) Divide clock by 256 Position */
#define SUPC_BODVDD_PSEL_DIV512               (SUPC_BODVDD_PSEL_DIV512_Val << SUPC_BODVDD_PSEL_Pos) /* (SUPC_BODVDD) Divide clock by 512 Position */
#define SUPC_BODVDD_PSEL_DIV1024              (SUPC_BODVDD_PSEL_DIV1024_Val << SUPC_BODVDD_PSEL_Pos) /* (SUPC_BODVDD) Divide clock by 1024 Position */
#define SUPC_BODVDD_PSEL_DIV2048              (SUPC_BODVDD_PSEL_DIV2048_Val << SUPC_BODVDD_PSEL_Pos) /* (SUPC_BODVDD) Divide clock by 2048 Position */
#define SUPC_BODVDD_PSEL_DIV4096              (SUPC_BODVDD_PSEL_DIV4096_Val << SUPC_BODVDD_PSEL_Pos) /* (SUPC_BODVDD) Divide clock by 4096 Position */
#define SUPC_BODVDD_PSEL_DIV8192              (SUPC_BODVDD_PSEL_DIV8192_Val << SUPC_BODVDD_PSEL_Pos) /* (SUPC_BODVDD) Divide clock by 8192 Position */
#define SUPC_BODVDD_PSEL_DIV16384             (SUPC_BODVDD_PSEL_DIV16384_Val << SUPC_BODVDD_PSEL_Pos) /* (SUPC_BODVDD) Divide clock by 16384 Position */
#define SUPC_BODVDD_PSEL_DIV32768             (SUPC_BODVDD_PSEL_DIV32768_Val << SUPC_BODVDD_PSEL_Pos) /* (SUPC_BODVDD) Divide clock by 32768 Position */
#define SUPC_BODVDD_PSEL_DIV65536             (SUPC_BODVDD_PSEL_DIV65536_Val << SUPC_BODVDD_PSEL_Pos) /* (SUPC_BODVDD) Divide clock by 65536 Position */
#define SUPC_BODVDD_LEVEL_Pos                 _UINT32_(16)                                         /* (SUPC_BODVDD) Threshold Level for VDD Position */
#define SUPC_BODVDD_LEVEL_Msk                 (_UINT32_(0x3F) << SUPC_BODVDD_LEVEL_Pos)            /* (SUPC_BODVDD) Threshold Level for VDD Mask */
#define SUPC_BODVDD_LEVEL(value)              (SUPC_BODVDD_LEVEL_Msk & (_UINT32_(value) << SUPC_BODVDD_LEVEL_Pos)) /* Assignment of value for LEVEL in the SUPC_BODVDD register */
#define SUPC_BODVDD_Msk                       _UINT32_(0x003FF17E)                                 /* (SUPC_BODVDD) Register Mask  */


/* -------- SUPC_BODCORE : (SUPC Offset: 0x14) (R/W 32) BODCORE Control -------- */
#define SUPC_BODCORE_RESETVALUE               _UINT32_(0x00)                                       /*  (SUPC_BODCORE) BODCORE Control  Reset Value */

