Microchip-MPLAB-Harmony/reference_apps_pic32cm/apps/pic32cm_jh_vl_cnano/pic32cm_jh_vl_cnano_mikroe_click/pic32cm_jh_mcp25625/firmware/src/packs/PIC32CM6408JH00064_DFP/component/supc.h
#define SUPC_BODCORE_ENABLE_Pos               _UINT32_(1)                                          /* (SUPC_BODCORE) Enable Position */
#define SUPC_BODCORE_ENABLE_Msk               (_UINT32_(0x1) << SUPC_BODCORE_ENABLE_Pos)           /* (SUPC_BODCORE) Enable Mask */
#define SUPC_BODCORE_ENABLE(value)            (SUPC_BODCORE_ENABLE_Msk & (_UINT32_(value) << SUPC_BODCORE_ENABLE_Pos)) /* Assignment of value for ENABLE in the SUPC_BODCORE register */
#define SUPC_BODCORE_HYST_Pos                 _UINT32_(2)                                          /* (SUPC_BODCORE) Hysteresis Enable Position */
#define SUPC_BODCORE_HYST_Msk                 (_UINT32_(0x1) << SUPC_BODCORE_HYST_Pos)             /* (SUPC_BODCORE) Hysteresis Enable Mask */
#define SUPC_BODCORE_HYST(value)              (SUPC_BODCORE_HYST_Msk & (_UINT32_(value) << SUPC_BODCORE_HYST_Pos)) /* Assignment of value for HYST in the SUPC_BODCORE register */
#define SUPC_BODCORE_ACTION_Pos               _UINT32_(3)                                          /* (SUPC_BODCORE) Action when Threshold Crossed Position */
#define SUPC_BODCORE_ACTION_Msk               (_UINT32_(0x3) << SUPC_BODCORE_ACTION_Pos)           /* (SUPC_BODCORE) Action when Threshold Crossed Mask */
#define SUPC_BODCORE_ACTION(value)            (SUPC_BODCORE_ACTION_Msk & (_UINT32_(value) << SUPC_BODCORE_ACTION_Pos)) /* Assignment of value for ACTION in the SUPC_BODCORE register */
#define   SUPC_BODCORE_ACTION_NONE_Val        _UINT32_(0x0)                                        /* (SUPC_BODCORE) No action  */
#define   SUPC_BODCORE_ACTION_RESET_Val       _UINT32_(0x1)                                        /* (SUPC_BODCORE) The BODCORE generates a reset  */
#define   SUPC_BODCORE_ACTION_INT_Val         _UINT32_(0x2)                                        /* (SUPC_BODCORE) The BODCORE generates an interrupt  */
#define SUPC_BODCORE_ACTION_NONE              (SUPC_BODCORE_ACTION_NONE_Val << SUPC_BODCORE_ACTION_Pos) /* (SUPC_BODCORE) No action Position */
#define SUPC_BODCORE_ACTION_RESET             (SUPC_BODCORE_ACTION_RESET_Val << SUPC_BODCORE_ACTION_Pos) /* (SUPC_BODCORE) The BODCORE generates a reset Position */
#define SUPC_BODCORE_ACTION_INT               (SUPC_BODCORE_ACTION_INT_Val << SUPC_BODCORE_ACTION_Pos) /* (SUPC_BODCORE) The BODCORE generates an interrupt Position */
#define SUPC_BODCORE_STDBYCFG_Pos             _UINT32_(5)                                          /* (SUPC_BODCORE) Configuration in Standby mode Position */
#define SUPC_BODCORE_STDBYCFG_Msk             (_UINT32_(0x1) << SUPC_BODCORE_STDBYCFG_Pos)         /* (SUPC_BODCORE) Configuration in Standby mode Mask */
#define SUPC_BODCORE_STDBYCFG(value)          (SUPC_BODCORE_STDBYCFG_Msk & (_UINT32_(value) << SUPC_BODCORE_STDBYCFG_Pos)) /* Assignment of value for STDBYCFG in the SUPC_BODCORE register */
#define SUPC_BODCORE_RUNSTDBY_Pos             _UINT32_(6)                                          /* (SUPC_BODCORE) Run during Standby Position */
#define SUPC_BODCORE_RUNSTDBY_Msk             (_UINT32_(0x1) << SUPC_BODCORE_RUNSTDBY_Pos)         /* (SUPC_BODCORE) Run during Standby Mask */
#define SUPC_BODCORE_RUNSTDBY(value)          (SUPC_BODCORE_RUNSTDBY_Msk & (_UINT32_(value) << SUPC_BODCORE_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the SUPC_BODCORE register */
#define SUPC_BODCORE_ACTCFG_Pos               _UINT32_(8)                                          /* (SUPC_BODCORE) Configuration in Active mode Position */
#define SUPC_BODCORE_ACTCFG_Msk               (_UINT32_(0x1) << SUPC_BODCORE_ACTCFG_Pos)           /* (SUPC_BODCORE) Configuration in Active mode Mask */
#define SUPC_BODCORE_ACTCFG(value)            (SUPC_BODCORE_ACTCFG_Msk & (_UINT32_(value) << SUPC_BODCORE_ACTCFG_Pos)) /* Assignment of value for ACTCFG in the SUPC_BODCORE register */
#define SUPC_BODCORE_PSEL_Pos                 _UINT32_(12)                                         /* (SUPC_BODCORE) Prescaler Select Position */
#define SUPC_BODCORE_PSEL_Msk                 (_UINT32_(0xF) << SUPC_BODCORE_PSEL_Pos)             /* (SUPC_BODCORE) Prescaler Select Mask */
#define SUPC_BODCORE_PSEL(value)              (SUPC_BODCORE_PSEL_Msk & (_UINT32_(value) << SUPC_BODCORE_PSEL_Pos)) /* Assignment of value for PSEL in the SUPC_BODCORE register */
#define   SUPC_BODCORE_PSEL_DIV2_Val          _UINT32_(0x0)                                        /* (SUPC_BODCORE) Divide clock by 2  */
#define   SUPC_BODCORE_PSEL_DIV4_Val          _UINT32_(0x1)                                        /* (SUPC_BODCORE) Divide clock by 4  */
#define   SUPC_BODCORE_PSEL_DIV8_Val          _UINT32_(0x2)                                        /* (SUPC_BODCORE) Divide clock by 8  */
#define   SUPC_BODCORE_PSEL_DIV16_Val         _UINT32_(0x3)                                        /* (SUPC_BODCORE) Divide clock by 16  */
#define   SUPC_BODCORE_PSEL_DIV32_Val         _UINT32_(0x4)                                        /* (SUPC_BODCORE) Divide clock by 32  */
#define   SUPC_BODCORE_PSEL_DIV64_Val         _UINT32_(0x5)                                        /* (SUPC_BODCORE) Divide clock by 64  */
#define   SUPC_BODCORE_PSEL_DIV128_Val        _UINT32_(0x6)                                        /* (SUPC_BODCORE) Divide clock by 128  */
#define   SUPC_BODCORE_PSEL_DIV256_Val        _UINT32_(0x7)                                        /* (SUPC_BODCORE) Divide clock by 256  */
#define   SUPC_BODCORE_PSEL_DIV512_Val        _UINT32_(0x8)                                        /* (SUPC_BODCORE) Divide clock by 512  */
#define   SUPC_BODCORE_PSEL_DIV1024_Val       _UINT32_(0x9)                                        /* (SUPC_BODCORE) Divide clock by 1024  */
#define   SUPC_BODCORE_PSEL_DIV2048_Val       _UINT32_(0xA)                                        /* (SUPC_BODCORE) Divide clock by 2048  */
#define   SUPC_BODCORE_PSEL_DIV4096_Val       _UINT32_(0xB)                                        /* (SUPC_BODCORE) Divide clock by 4096  */
#define   SUPC_BODCORE_PSEL_DIV8192_Val       _UINT32_(0xC)                                        /* (SUPC_BODCORE) Divide clock by 8192  */
#define   SUPC_BODCORE_PSEL_DIV16384_Val      _UINT32_(0xD)                                        /* (SUPC_BODCORE) Divide clock by 16384  */
#define   SUPC_BODCORE_PSEL_DIV32768_Val      _UINT32_(0xE)                                        /* (SUPC_BODCORE) Divide clock by 32768  */
#define   SUPC_BODCORE_PSEL_DIV65536_Val      _UINT32_(0xF)                                        /* (SUPC_BODCORE) Divide clock by 65536  */
#define SUPC_BODCORE_PSEL_DIV2                (SUPC_BODCORE_PSEL_DIV2_Val << SUPC_BODCORE_PSEL_Pos) /* (SUPC_BODCORE) Divide clock by 2 Position */
#define SUPC_BODCORE_PSEL_DIV4                (SUPC_BODCORE_PSEL_DIV4_Val << SUPC_BODCORE_PSEL_Pos) /* (SUPC_BODCORE) Divide clock by 4 Position */
#define SUPC_BODCORE_PSEL_DIV8                (SUPC_BODCORE_PSEL_DIV8_Val << SUPC_BODCORE_PSEL_Pos) /* (SUPC_BODCORE) Divide clock by 8 Position */
#define SUPC_BODCORE_PSEL_DIV16               (SUPC_BODCORE_PSEL_DIV16_Val << SUPC_BODCORE_PSEL_Pos) /* (SUPC_BODCORE) Divide clock by 16 Position */
#define SUPC_BODCORE_PSEL_DIV32               (SUPC_BODCORE_PSEL_DIV32_Val << SUPC_BODCORE_PSEL_Pos) /* (SUPC_BODCORE) Divide clock by 32 Position */
#define SUPC_BODCORE_PSEL_DIV64               (SUPC_BODCORE_PSEL_DIV64_Val << SUPC_BODCORE_PSEL_Pos) /* (SUPC_BODCORE) Divide clock by 64 Position */
#define SUPC_BODCORE_PSEL_DIV128              (SUPC_BODCORE_PSEL_DIV128_Val << SUPC_BODCORE_PSEL_Pos) /* (SUPC_BODCORE) Divide clock by 128 Position */
#define SUPC_BODCORE_PSEL_DIV256              (SUPC_BODCORE_PSEL_DIV256_Val << SUPC_BODCORE_PSEL_Pos) /* (SUPC_BODCORE) Divide clock by 256 Position */
#define SUPC_BODCORE_PSEL_DIV512              (SUPC_BODCORE_PSEL_DIV512_Val << SUPC_BODCORE_PSEL_Pos) /* (SUPC_BODCORE) Divide clock by 512 Position */
#define SUPC_BODCORE_PSEL_DIV1024             (SUPC_BODCORE_PSEL_DIV1024_Val << SUPC_BODCORE_PSEL_Pos) /* (SUPC_BODCORE) Divide clock by 1024 Position */
#define SUPC_BODCORE_PSEL_DIV2048             (SUPC_BODCORE_PSEL_DIV2048_Val << SUPC_BODCORE_PSEL_Pos) /* (SUPC_BODCORE) Divide clock by 2048 Position */
#define SUPC_BODCORE_PSEL_DIV4096             (SUPC_BODCORE_PSEL_DIV4096_Val << SUPC_BODCORE_PSEL_Pos) /* (SUPC_BODCORE) Divide clock by 4096 Position */
#define SUPC_BODCORE_PSEL_DIV8192             (SUPC_BODCORE_PSEL_DIV8192_Val << SUPC_BODCORE_PSEL_Pos) /* (SUPC_BODCORE) Divide clock by 8192 Position */
#define SUPC_BODCORE_PSEL_DIV16384            (SUPC_BODCORE_PSEL_DIV16384_Val << SUPC_BODCORE_PSEL_Pos) /* (SUPC_BODCORE) Divide clock by 16384 Position */
#define SUPC_BODCORE_PSEL_DIV32768            (SUPC_BODCORE_PSEL_DIV32768_Val << SUPC_BODCORE_PSEL_Pos) /* (SUPC_BODCORE) Divide clock by 32768 Position */
#define SUPC_BODCORE_PSEL_DIV65536            (SUPC_BODCORE_PSEL_DIV65536_Val << SUPC_BODCORE_PSEL_Pos) /* (SUPC_BODCORE) Divide clock by 65536 Position */
#define SUPC_BODCORE_LEVEL_Pos                _UINT32_(16)                                         /* (SUPC_BODCORE) Threshold Level Position */
#define SUPC_BODCORE_LEVEL_Msk                (_UINT32_(0x3F) << SUPC_BODCORE_LEVEL_Pos)           /* (SUPC_BODCORE) Threshold Level Mask */
#define SUPC_BODCORE_LEVEL(value)             (SUPC_BODCORE_LEVEL_Msk & (_UINT32_(value) << SUPC_BODCORE_LEVEL_Pos)) /* Assignment of value for LEVEL in the SUPC_BODCORE register */
#define SUPC_BODCORE_Msk                      _UINT32_(0x003FF17E)                                 /* (SUPC_BODCORE) Register Mask  */


/* -------- SUPC_VREG : (SUPC Offset: 0x18) (R/W 32) VREG Control -------- */
#define SUPC_VREG_RESETVALUE                  _UINT32_(0x00)                                       /*  (SUPC_VREG) VREG Control  Reset Value */

#define SUPC_VREG_ENABLE_Pos                  _UINT32_(1)                                          /* (SUPC_VREG) Enable Position */
#define SUPC_VREG_ENABLE_Msk                  (_UINT32_(0x1) << SUPC_VREG_ENABLE_Pos)              /* (SUPC_VREG) Enable Mask */
#define SUPC_VREG_ENABLE(value)               (SUPC_VREG_ENABLE_Msk & (_UINT32_(value) << SUPC_VREG_ENABLE_Pos)) /* Assignment of value for ENABLE in the SUPC_VREG register */
#define SUPC_VREG_RUNSTDBY_Pos                _UINT32_(6)                                          /* (SUPC_VREG) Run during Standby Position */
#define SUPC_VREG_RUNSTDBY_Msk                (_UINT32_(0x1) << SUPC_VREG_RUNSTDBY_Pos)            /* (SUPC_VREG) Run during Standby Mask */
#define SUPC_VREG_RUNSTDBY(value)             (SUPC_VREG_RUNSTDBY_Msk & (_UINT32_(value) << SUPC_VREG_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the SUPC_VREG register */
#define SUPC_VREG_Msk                         _UINT32_(0x00000042)                                 /* (SUPC_VREG) Register Mask  */


/* -------- SUPC_VREF : (SUPC Offset: 0x1C) (R/W 32) VREF Control -------- */
#define SUPC_VREF_RESETVALUE                  _UINT32_(0x00)                                       /*  (SUPC_VREF) VREF Control  Reset Value */

#define SUPC_VREF_TSEN_Pos                    _UINT32_(1)                                          /* (SUPC_VREF) Temperature Sensor Output Enable Position */
#define SUPC_VREF_TSEN_Msk                    (_UINT32_(0x1) << SUPC_VREF_TSEN_Pos)                /* (SUPC_VREF) Temperature Sensor Output Enable Mask */
#define SUPC_VREF_TSEN(value)                 (SUPC_VREF_TSEN_Msk & (_UINT32_(value) << SUPC_VREF_TSEN_Pos)) /* Assignment of value for TSEN in the SUPC_VREF register */
#define SUPC_VREF_VREFOE_Pos                  _UINT32_(2)                                          /* (SUPC_VREF) Voltage Reference Output Enable Position */
#define SUPC_VREF_VREFOE_Msk                  (_UINT32_(0x1) << SUPC_VREF_VREFOE_Pos)              /* (SUPC_VREF) Voltage Reference Output Enable Mask */
#define SUPC_VREF_VREFOE(value)               (SUPC_VREF_VREFOE_Msk & (_UINT32_(value) << SUPC_VREF_VREFOE_Pos)) /* Assignment of value for VREFOE in the SUPC_VREF register */
#define SUPC_VREF_RUNSTDBY_Pos                _UINT32_(6)                                          /* (SUPC_VREF) Run during Standby Position */
#define SUPC_VREF_RUNSTDBY_Msk                (_UINT32_(0x1) << SUPC_VREF_RUNSTDBY_Pos)            /* (SUPC_VREF) Run during Standby Mask */
#define SUPC_VREF_RUNSTDBY(value)             (SUPC_VREF_RUNSTDBY_Msk & (_UINT32_(value) << SUPC_VREF_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the SUPC_VREF register */
#define SUPC_VREF_ONDEMAND_Pos                _UINT32_(7)                                          /* (SUPC_VREF) On Demand Contrl Position */
#define SUPC_VREF_ONDEMAND_Msk                (_UINT32_(0x1) << SUPC_VREF_ONDEMAND_Pos)            /* (SUPC_VREF) On Demand Contrl Mask */
#define SUPC_VREF_ONDEMAND(value)             (SUPC_VREF_ONDEMAND_Msk & (_UINT32_(value) << SUPC_VREF_ONDEMAND_Pos)) /* Assignment of value for ONDEMAND in the SUPC_VREF register */
#define SUPC_VREF_SEL_Pos                     _UINT32_(16)                                         /* (SUPC_VREF) Voltage Reference Selection Position */
#define SUPC_VREF_SEL_Msk                     (_UINT32_(0xF) << SUPC_VREF_SEL_Pos)                 /* (SUPC_VREF) Voltage Reference Selection Mask */
#define SUPC_VREF_SEL(value)                  (SUPC_VREF_SEL_Msk & (_UINT32_(value) << SUPC_VREF_SEL_Pos)) /* Assignment of value for SEL in the SUPC_VREF register */
#define   SUPC_VREF_SEL_1V024_Val             _UINT32_(0x0)                                        /* (SUPC_VREF) 1.024V voltage reference typical value  */
#define   SUPC_VREF_SEL_2V048_Val             _UINT32_(0x2)                                        /* (SUPC_VREF) 2.048V voltage reference typical value  */
#define   SUPC_VREF_SEL_4V096_Val             _UINT32_(0x3)                                        /* (SUPC_VREF) 4.096V voltage reference typical value  */
#define SUPC_VREF_SEL_1V024                   (SUPC_VREF_SEL_1V024_Val << SUPC_VREF_SEL_Pos)       /* (SUPC_VREF) 1.024V voltage reference typical value Position */
#define SUPC_VREF_SEL_2V048                   (SUPC_VREF_SEL_2V048_Val << SUPC_VREF_SEL_Pos)       /* (SUPC_VREF) 2.048V voltage reference typical value Position */
#define SUPC_VREF_SEL_4V096                   (SUPC_VREF_SEL_4V096_Val << SUPC_VREF_SEL_Pos)       /* (SUPC_VREF) 4.096V voltage reference typical value Position */
#define SUPC_VREF_Msk                         _UINT32_(0x000F00C6)                                 /* (SUPC_VREF) Register Mask  */


/* SUPC register offsets definitions */
#define SUPC_INTENCLR_REG_OFST         _UINT32_(0x00)      /* (SUPC_INTENCLR) Interrupt Enable Clear Offset */
#define SUPC_INTENSET_REG_OFST         _UINT32_(0x04)      /* (SUPC_INTENSET) Interrupt Enable Set Offset */
#define SUPC_INTFLAG_REG_OFST          _UINT32_(0x08)      /* (SUPC_INTFLAG) Interrupt Flag Status and Clear Offset */
#define SUPC_STATUS_REG_OFST           _UINT32_(0x0C)      /* (SUPC_STATUS) Power and Clocks Status Offset */
#define SUPC_BODVDD_REG_OFST           _UINT32_(0x10)      /* (SUPC_BODVDD) BODVDD Control Offset */
#define SUPC_BODCORE_REG_OFST          _UINT32_(0x14)      /* (SUPC_BODCORE) BODCORE Control Offset */
#define SUPC_VREG_REG_OFST             _UINT32_(0x18)      /* (SUPC_VREG) VREG Control Offset */
#define SUPC_VREF_REG_OFST             _UINT32_(0x1C)      /* (SUPC_VREF) VREF Control Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* SUPC register API structure */
typedef struct
{  /* Supply Controller */
  __IO  uint32_t                       SUPC_INTENCLR;      /* Offset: 0x00 (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       SUPC_INTENSET;      /* Offset: 0x04 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       SUPC_INTFLAG;       /* Offset: 0x08 (R/W  32) Interrupt Flag Status and Clear */
  __I   uint32_t                       SUPC_STATUS;        /* Offset: 0x0C (R/   32) Power and Clocks Status */
  __IO  uint32_t                       SUPC_BODVDD;        /* Offset: 0x10 (R/W  32) BODVDD Control */
  __IO  uint32_t                       SUPC_BODCORE;       /* Offset: 0x14 (R/W  32) BODCORE Control */
  __IO  uint32_t                       SUPC_VREG;          /* Offset: 0x18 (R/W  32) VREG Control */
  __IO  uint32_t                       SUPC_VREF;          /* Offset: 0x1C (R/W  32) VREF Control */
} supc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMJH00_SUPC_COMPONENT_H_ */
